# -*- coding: utf-8 -*-
class ParametersManager:
    def __init__(self):
        self.parameters = {
            'Вентилятор':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                    'ADSK_Свободный напор воздуха',
                    'ADSK_Номинальная мощность',
                ],
                'omni_class':'23.75.35.17'
            },
            'Приточная установка':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                    'ADSK_Свободный напор воздуха',
                    'ADSK_Номинальная мощность',
                    'ADSK_Расход жидкости',
                ],
                'omni_class':'23.75.35.14'
            },
            'Приточно-вытяжная установка':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                    'ADSK_Свободный напор воздуха',
                    'ADSK_Номинальная мощность',
                    'ADSK_Расход жидкости',
                ],
                'omni_class':'23.75.35.14'
            },
            'Воздушная завеса':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                    'ADSK_Свободный напор воздуха',
                    'ADSK_Номинальная мощность',
                    'ADSK_Расход жидкости',
                ],
                'omni_class':'23.75.10.17'
            },
            'Воздушно-отопительный агрегат':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                    'ADSK_Свободный напор воздуха',
                    'ADSK_Номинальная мощность',
                    'ADSK_Расход жидкости',
                ],
                'omni_class':'23.75.10.17'
            },
            'Наружный блок':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                    'ADSK_Номинальная мощность',
                ],
                'omni_class':'23.75.10.24'
            },
            'Внутренний блок':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                    'ADSK_Номинальная мощность',
                ],
                'omni_class':'23.75.10.24'
            },
            'Радиатор':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход жидкости',
                ],
                'omni_class':'23.75.10.17'
            },
            'Конвектор':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход жидкости',
                ],
                'omni_class':'23.75.10.17'
            },
            'Регистр':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход жидкости',
                ],
                'omni_class':'23.75.10.17'
            },
            'Электрообогреватель':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                ],
                'omni_class':'23.75.10.14'
            },
            'Воздухонагреватель':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                ],
                'omni_class':'23.75.10.14'
            },
            'Клапан балансировочный':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                ],
                'omni_class':'23.65.55.14'
            },
            'Кран шаровый':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                ],
                'omni_class':'23.65.55.14'
            },
            'Компенсатор сильфонный':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                ],
                'omni_class':'23.60.30.11'
            },
            'Клапан радиаторный':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                ],
                'omni_class':'23.65.55.14'
            },
            'Шкаф отопления':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                ],
                'omni_class':'23.65.55.14'
            },
            'Узел регулирования':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                ],
                'omni_class':'23.65.55.14'
            },
            'Теплосчетчик':
            {
                'parameters':
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                ],
                'omni_class':'23.60.10.17'
            },
            'Стакан монтажный':
            {
                'parameters':    
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                ],
                'omni_class':'23.75.70.14'
            },
            'Решетка':
            {
                'parameters':    
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                ],
                'omni_class':'23.75.70.21'
            },
            'Диффузор':
            {
                'parameters':    
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                ],
                'omni_class':'23.75.70.21'
            },
            'Клапан противопожарный':
            {
                'parameters':    
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                ],
                'omni_class':'23.60.70.11'
            },
            'Клапан обратный':
            {
                'parameters':    
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                ],
                'omni_class':'23.60.70.11'
            },
            'Фильтр воздушный':
            {
                'parameters':    
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                ],
                'omni_class':'23.60.70.11'
            },
            'Клапан воздушный':
            {
                'parameters':    
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                ],
                'omni_class':'23.60.70.11'
            },
            'Заслонка':
            {
                'parameters':    
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                ],
                'omni_class':'23.60.70.11'
            },
            'Вставка гибкая':
            {
                'parameters':    
                [
                    'ADSK_Позиция',
                    'ADSK_Обозначение',
                    'ADSK_Наименование',
                    'ADSK_Наименование краткое',
                    'ADSK_Примечание',
                    'ADSK_Масса',
                    'ADSK_Примечание',
                    'ADSK_Единица измерения',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Количество',
                    'ADSK_Код изделия',
                    'ADSK_Предел огнестойкости',
                    'ADSK_Группирование',
                    'ADSK_Размер_Высота',
                    'ADSK_Размер_Длина',
                    'ADSK_Размер_Ширина',
                    'ADSK_Материал',
                    'ADSK_Марка',
                    'ADSK_Завод-изготовитель',
                    'ADSK_Расход воздуха',
                ],
                'omni_class':'23.60.70.11'
            },
        }

    def get_parameters(self, family_name=''):
        parameters = []
        for name, data in self.parameters.items():
            if name in family_name:
                parameters = data['parameters']
        return parameters

    def get_omni_class_num(self, family_name=''):
        omni_class_number = ''
        for name, data in self.parameters.items():
            if name in family_name:
                omni_class_number = data['omni_class']
        return omni_class_number